from note import Note

istiklal = []

# MAIN CHANNEL
istiklal.append([
    Note("B4", "4", 0.75),  # Kork
    Note("E5", "4", 0.75),  # ma
    Note("F#5", "4", 0.75),  # sön
    Note("G5", "4", 0.75),  # mez
    Note("D#5", "8.", 0.75),  # bu
    Note("F#5", "16", 0.75),  # $a
    Note("E5", "2.", 0.75),  # fak
    Note("E5", "4", 0.75),  # lar
    Note("A5", "4", 0.75),  # da
    Note("B5", "4", 0.75),  # yü
    Note("C6", "8.", 0.75),  # zen
    Note("B5", "16", 0.75),  # -
    Note("G#5", "8.", 0.75),  # al
    Note("B5", "16", 0.75),  # san
    Note("A5", "2.", 0.75),  # cak
    Note("B5", "8/3", 0.75),  # Son
    Note("A#5", "8/3", 0.75),  # me
    Note("B5", "8/3", 0.75),  # den
    Note("F#5", "4", 0.75),  # yur
    Note("F#5", "4..", 0.75),  # du
    Note("A5", "16", 0.75),  # mun
    Note("G5", "8.", 0.75),  # üs
    Note("D#5", "16", 0.75),  # tün
    Note("E5", "8.", 0.75),  # de
    Note("F#5", "16", 0.75),  # tü
    Note("G5", "8.", 0.75),  # ten
    Note("A5", "16", 0.75),  # en
    Note("B5", "8.", 0.75),  # son
    Note("C6", "16", 0.75),  # o
    Note("D6", "8.", 0.75),  # cak
    Note("E6", "16", 0.75),  # o
    Note("D6", "4", 0.75),  # be
    Note("D5", "8/3", 0.75),  # nim
    Note("C#5", "8/3", 0.75),  # nim
    Note("D5", "8/3", 0.75),  # mil
    Note("B5", "4", 0.75),  # le
    Note("A5", "4", 0.75),  # ti
    Note("G5", "2.", 0.75),  # min
    Note("B4", "8/3", 0.75),  # yıl
    Note("A#4", "8/3", 0.75),  # dı
    Note("B4", "8/3", 0.75),  # zı
    Note("F#5", "4", 0.75),  # dır
    Note("B4", "4", 0.75),  # par
    Note("B5", "8.", 0.75),  # la
    Note("A5", "16", 0.75),  # ya
    Note("G5", "8/3", 0.75),  # cak
    Note("F#5", "8/3", 0.75),  # o
    Note("G5", "8/3", 0.75),  # be
    Note("E5", "4", 0.75),  # nim
    Note("E6", "4..", 0.75),  # dir
    Note("D6", "16", 0.75),  # o
    Note("C6", "8.", 0.75),  # be
    Note("B5", "16", 0.75),  # nim
    Note("A5", "8.", 0.75),  # mil
    Note("G5", "16", 0.75),  # le
    Note("F#5", "8.", 0.75),  # ti
    Note("E5", "16", 0.75),  # min
    Note("B5", "4", 0.75),  # dir
    Note("B4", "4", 0.75),  # an
    Note("E5", "2.", 0.75)  # cak
])

# SECOND CHANNEL
istiklal.append([
    Note("B5", "4", 0.75),  # Kork
    Note("E6", "4", 0.75),  # ma
    Note("F#6", "4", 0.75),  # sön
    Note("G6", "4", 0.75),  # mez
    Note("D#6", "8.", 0.75),  # bu
    Note("F#6", "16", 0.75),  # $a
    Note("E6", "2.", 0.75),  # fak
    Note("E6", "4", 0.75),  # lar
    Note("A6", "4", 0.75),  # da
    Note("B6", "4", 0.75),  # yü
    Note("C7", "8.", 0.75),  # zen
    Note("B6", "16", 0.75),  # -
    Note("G#6", "8.", 0.75),  # al
    Note("B6", "16", 0.75),  # san
    Note("A6", "2.", 0.75),  # cak
    Note("B6", "8/3", 0.75),  # Son
    Note("A#6", "8/3", 0.75),  # me
    Note("B6", "8/3", 0.75),  # den
    Note("F#6", "4", 0.75),  # yur
    Note("F#6", "4..", 0.75),  # du
    Note("A6", "16", 0.75),  # mun
    Note("G6", "8.", 0.75),  # üs
    Note("D#6", "16", 0.75),  # tün
    Note("E6", "8.", 0.75),  # de
    Note("F#6", "16", 0.75),  # tü
    Note("G6", "8.", 0.75),  # ten
    Note("A6", "16", 0.75),  # en
    Note("B6", "8.", 0.75),  # son
    Note("C7", "16", 0.75),  # o
    Note("D7", "8.", 0.75),  # cak
    Note("E7", "16", 0.75),  # o
    Note("D7", "4", 0.75),  # be
    Note("D6", "8/3", 0.75),  # nim
    Note("C#6", "8/3", 0.75),  # nim
    Note("D6", "8/3", 0.75),  # mil
    Note("B6", "4", 0.75),  # le
    Note("A6", "4", 0.75),  # ti
    Note("G6", "2.", 0.75),  # min
    Note("B5", "8/3", 0.75),  # yıl
    Note("A#5", "8/3", 0.75),  # dı
    Note("B5", "8/3", 0.75),  # zı
    Note("F#6", "4", 0.75),  # dır
    Note("B5", "4", 0.75),  # par
    Note("B6", "8.", 0.75),  # la
    Note("A6", "16", 0.75),  # ya
    Note("G6", "8/3", 0.75),  # cak
    Note("F#6", "8/3", 0.75),  # o
    Note("G6", "8/3", 0.75),  # be
    Note("E6", "4", 0.75),  # nim
    Note("E7", "4..", 0.75),  # dir
    Note("D7", "16", 0.75),  # o
    Note("C7", "8.", 0.75),  # be
    Note("B6", "16", 0.75),  # nim
    Note("A6", "8.", 0.75),  # mil
    Note("G6", "16", 0.75),  # le
    Note("F#6", "8.", 0.75),  # ti
    Note("E6", "16", 0.75),  # min
    Note("B6", "4", 0.75),  # dir
    Note("B5", "4", 0.75),  # an
    Note("E6", "2.", 0.75)  # cak
])

# THIRD CHANNEL
istiklal.append([
    Note("R", "4", 0.75),  # Kork
    Note("R", "4", 0.75),  # ma
    Note("R", "4", 0.75),  # sön
    Note("R", "4", 0.75),  # mez
    Note("R", "8.", 0.75),  # bu
    Note("R", "16", 0.75),  # $a
    Note("R", "2.", 0.75),  # fak
    Note("G5", "4", 0.75),  # lar
    Note("C#5", "4", 0.75),  # da
    Note("D6", "4", 0.75),  # yü
    Note("C6", "8.", 0.75),  # zen
    Note("D#6", "16", 0.75),  # -
    Note("B6", "8.", 0.75),  # al
    Note("D6", "16", 0.75),  # san
    Note("C#6", "2.", 0.75),  # cak
    Note("R", "8/3", 0.75),  # Son
    Note("R", "8/3", 0.75),  # me
    Note("R", "8/3", 0.75),  # den
    Note("R", "4", 0.75),  # yur
    Note("R", "4..", 0.75),  # du
    Note("R", "16", 0.75),  # mun
    Note("R", "8.", 0.75),  # üs
    Note("R", "16", 0.75),  # tün
    Note("R", "8.", 0.75),  # de
    Note("A6", "16", 0.75),  # tü
    Note("A#6", "8.", 0.75),  # ten
    Note("C6", "16", 0.75),  # en
    Note("D6", "8.", 0.75),  # son
    Note("D#7", "16", 0.75),  # o
    Note("F#7", "8.", 0.75),  # cak
    Note("G7", "16", 0.75),  # o
    Note("F#7", "4", 0.75),  # be
    Note("F#6", "8/3", 0.75),  # nim
    Note("R", "8/3", 0.75),  # nim
    Note("R", "8/3", 0.75),  # mil
    Note("R", "4", 0.75),  # le
    Note("R", "4", 0.75),  # ti
    Note("R", "2.", 0.75),  # min
    Note("R", "8/3", 0.75),  # yıl
    Note("R", "8/3", 0.75),  # dı
    Note("R", "8/3", 0.75),  # zı
    Note("R", "4", 0.75),  # dır
    Note("R", "4", 0.75),  # par
    Note("R", "8.", 0.75),  # la
    Note("R", "16", 0.75),  # ya
    Note("R", "8/3", 0.75),  # cak
    Note("R", "8/3", 0.75),  # o
    Note("R", "8/3", 0.75),  # be
    Note("R", "4", 0.75),  # nim
    Note("F#7", "4..", 0.75),  # dir
    Note("F7", "16", 0.75),  # o
    Note("D#7", "8.", 0.75),  # be
    Note("D6", "16", 0.75),  # nim
    Note("C6", "8.", 0.75),  # mil
    Note("B6", "16", 0.75),  # le
    Note("A6", "8.", 0.75),  # ti
    Note("G5", "16", 0.75),  # min
    Note("B6", "4", 0.75),  # dir
    Note("D5", "4", 0.75),  # an
    Note("R", "2.", 0.75)  # cak
])

# BASS CHANNEL
istiklal.append([
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75),
    Note("E1", "8", 0.75),
    Note("R", "8", 0.75)
])
